// 0. Вывести квадрат числа 
//int a=3;
//Console.WriteLine(a*a);

//  1. По двум введённым числам проверять является ли первое квадратом второго
// int a = 3;
// int b = 45;
// if (a * a == b)
//     Console.WriteLine("yes");
// else Console.WriteLine("no");


//  2. Даны два числа. Показать большее и меньшее число
// int a = 6;
// int b = 38;
// int max = 0;
// int min = 0;
// if (a > b)
// {
//     max = a;
//     min = b;
// }
// if (b > a)
// {
//     max = b;
//     min = a;
// }
// Console.WriteLine($"max = {max}, min = {min}");

//  3. По введенному номеру дня недели вывести его название
// Console.WriteLine("Введите номер деня недели: ");
// int a = Convert.ToInt32(Console.ReadLine());
//     if (a == 1)
//     {
//         Console.WriteLine("Monday");
//     }
//     if (a == 2)
//     {
//         Console.WriteLine("Tuesday");
//     }
//     if (a == 3)
//     {
//         Console.WriteLine("Wednesday");
//     }
//     if (a == 4)
//     {
//         Console.WriteLine("Thursday");
//     }
//     if (a == 5)
//     {
//         Console.WriteLine("Friday");
//     }
//     if (a == 6)
//     {
//         Console.WriteLine("Saturday");
//     }
//     if (a == 7)
//     {
//         Console.WriteLine("Sunday");
//     }



//  4. Найти максимальное из трех чисел
// int a = 344;
// int b =1357;
// int c = 34;
// int max = a;
// if(b>max) max = b;
// if(c>max) max = c;
// Console.WriteLine(max);

//  5. Написать программу вычисления значения функции y=f(a) / y=2*a+b/c.
// int F(int a, int b, int c)
// {
// return 2*a + b/c; 
// }
// Console.WriteLine(F(2, 6, 5));

//  6. Выяснить является ли число чётным
int a = 22;
if(a%2==0)
{
    Console.WriteLine($"Четное: {a}");
}
if(a%2!=0)
{
    Console.WriteLine($"Нечетное: {a}");
}

Console.WriteLine();


//  7. Показать числа от -N до N


//  8. Показать четные числа от 1 до N


//  9. Показать последнюю цифру трёхзначного числа


// 10. Показать вторую цифру трёхзначного числа
